---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceServerUtils
source: html/ba04f1b5-0800-7f7f-138c-65aa6ea2e5c9.htm
---
# ExternalResourceServerUtils Methods

Checks whether the name is a valid short name for the external resource server.